zephyrproject-rtos/zephyr/drivers/i2c/i2c_ll_stm32_v2.c
/*
 * Copyright (c) 2016 BayLibre, SAS
 * Copyright (c) 2017 Linaro Ltd
 *
 * SPDX-License-Identifier: Apache-2.0
 *
 * I2C Driver for: STM32F0, STM32F3, STM32F7, STM32L0, STM32L4, STM32WB and
 * STM32WL
 *
 */

#include <zephyr/drivers/clock_control/stm32_clock_control.h>
#include <zephyr/drivers/clock_control.h>
#include <zephyr/sys/util.h>
#include <zephyr/kernel.h>
#include <soc.h>
#include <stm32_ll_i2c.h>
#include <errno.h>
#include <zephyr/drivers/i2c.h>
#include <zephyr/pm/device.h>
#include <zephyr/pm/device_runtime.h>
#include "i2c_ll_stm32.h"

#include <zephyr/cache.h>
#include <zephyr/linker/linker-defs.h>
#include <zephyr/mem_mgmt/mem_attr.h>
#include <zephyr/dt-bindings/memory-attr/memory-attr-arm.h>

#define LOG_LEVEL CONFIG_I2C_LOG_LEVEL
#include <zephyr/logging/log.h>
LOG_MODULE_REGISTER(i2c_ll_stm32_v2);

#include "i2c-priv.h"

#ifdef CONFIG_I2C_STM32_V2_TIMING
/* Use the algorithm to calcuate the I2C timing */
#ifndef STM32_I2C_VALID_TIMING_NBR
#define STM32_I2C_VALID_TIMING_NBR                 128U
#endif
#define STM32_I2C_SPEED_FREQ_STANDARD                0U    /* 100 kHz */
#define STM32_I2C_SPEED_FREQ_FAST                    1U    /* 400 kHz */
#define STM32_I2C_SPEED_FREQ_FAST_PLUS               2U    /* 1 MHz */
#define STM32_I2C_ANALOG_FILTER_DELAY_MIN            50U   /* ns */
#define STM32_I2C_ANALOG_FILTER_DELAY_MAX            260U  /* ns */
#define STM32_I2C_USE_ANALOG_FILTER                  1U
#define STM32_I2C_DIGITAL_FILTER_COEF                0U
#define STM32_I2C_PRESC_MAX                          16U
#define STM32_I2C_SCLDEL_MAX                         16U
#define STM32_I2C_SDADEL_MAX                         16U
#define STM32_I2C_SCLH_MAX                           256U
#define STM32_I2C_SCLL_MAX                           256U

/* I2C_DEVICE_Private_Types */
struct stm32_i2c_charac_t {
	uint32_t freq;       /* Frequency in Hz */
	uint32_t freq_min;   /* Minimum frequency in Hz */
	uint32_t freq_max;   /* Maximum frequency in Hz */
	uint32_t hddat_min;  /* Minimum data hold time in ns */
	uint32_t vddat_max;  /* Maximum data valid time in ns */
	uint32_t sudat_min;  /* Minimum data setup time in ns */
	uint32_t lscl_min;   /* Minimum low period of the SCL clock in ns */
	uint32_t hscl_min;   /* Minimum high period of SCL clock in ns */
	uint32_t trise;      /* Rise time in ns */
	uint32_t tfall;      /* Fall time in ns */
	uint32_t dnf;        /* Digital noise filter coefficient */
};

struct stm32_i2c_timings_t {
	uint32_t presc;      /* Timing prescaler */
	uint32_t tscldel;    /* SCL delay */
	uint32_t tsdadel;    /* SDA delay */
	uint32_t sclh;       /* SCL high period */
	uint32_t scll;       /* SCL low period */
};

/* I2C_DEVICE Private Constants */
static const struct stm32_i2c_charac_t stm32_i2c_charac[] = {
	[STM32_I2C_SPEED_FREQ_STANDARD] = {
		.freq = 100000,
		.freq_min = 80000,
		.freq_max = 120000,
		.hddat_min = 0,
		.vddat_max = 3450,
		.sudat_min = 250,
		.lscl_min = 4700,
		.hscl_min = 4000,
		.trise = 640,
		.tfall = 20,
		.dnf = STM32_I2C_DIGITAL_FILTER_COEF,
	},
	[STM32_I2C_SPEED_FREQ_FAST] = {
		.freq = 400000,
		.freq_min = 320000,
		.freq_max = 480000,
		.hddat_min = 0,
		.vddat_max = 900,
		.sudat_min = 100,
		.lscl_min = 1300,
		.hscl_min = 600,
		.trise = 250,
		.tfall = 100,
		.dnf = STM32_I2C_DIGITAL_FILTER_COEF,
	},
	[STM32_I2C_SPEED_FREQ_FAST_PLUS] = {
		.freq = 1000000,
		.freq_min = 800000,
		.freq_max = 1200000,
		.hddat_min = 0,
		.vddat_max = 450,
		.sudat_min = 50,
		.lscl_min = 500,
		.hscl_min = 260,
		.trise = 60,
		.tfall = 100,
		.dnf = STM32_I2C_DIGITAL_FILTER_COEF,
	},
};

static struct stm32_i2c_timings_t i2c_valid_timing[STM32_I2C_VALID_TIMING_NBR];
static uint32_t i2c_valid_timing_nbr;
#endif /* CONFIG_I2C_STM32_V2_TIMING */

#ifdef CONFIG_I2C_STM32_V2_DMA
static int configure_dma(struct stream const *dma, struct dma_config *dma_cfg,
			 struct dma_block_config *blk_cfg)
{
	if (!device_is_ready(dma->dev_dma)) {
		LOG_ERR("DMA device not ready");
		return -ENODEV;
	}

	dma_cfg->head_block = blk_cfg;
	dma_cfg->block_count = 1;

	int ret = dma_config(dma->dev_dma, dma->dma_channel, dma_cfg);

	if (ret != 0) {
		LOG_ERR("Problem setting up DMA: %d", ret);
		return ret;
	}

	ret = dma_start(dma->dev_dma, dma->dma_channel);

	if (ret != 0) {
		LOG_ERR("Problem starting DMA: %d", ret);
		return ret;
	}

	return 0;
}
#endif /* CONFIG_I2C_STM32_V2_DMA */

static inline void msg_init(const struct device *dev, struct i2c_msg *msg,
			    uint8_t *next_msg_flags, uint16_t slave,
			    uint32_t transfer)
{
	const struct i2c_stm32_config *cfg = dev->config;
	struct i2c_stm32_data *data = dev->data;
	I2C_TypeDef *i2c = cfg->i2c;

	if (LL_I2C_IsEnabledReloadMode(i2c)) {
		LL_I2C_SetTransferSize(i2c, msg->len);
	} else {
		if (I2C_ADDR_10_BITS & data->dev_config) {
			LL_I2C_SetMasterAddressingMode(i2c,
					LL_I2C_ADDRESSING_MODE_10BIT);
			LL_I2C_SetSlaveAddr(i2c, (uint32_t) slave);
		} else {
			LL_I2C_SetMasterAddressingMode(i2c,
				LL_I2C_ADDRESSING_MODE_7BIT);
			LL_I2C_SetSlaveAddr(i2c, (uint32_t) slave << 1);
		}

		if (!(msg->flags & I2C_MSG_STOP) && next_msg_flags &&
		    !(*next_msg_flags & I2C_MSG_RESTART)) {
			LL_I2C_EnableReloadMode(i2c);
		} else {
			LL_I2C_DisableReloadMode(i2c);
		}
		LL_I2C_DisableAutoEndMode(i2c);
		LL_I2C_SetTransferRequest(i2c, transfer);
		LL_I2C_SetTransferSize(i2c, msg->len);

#if defined(CONFIG_I2C_TARGET)
		data->master_active = true;
#endif

#ifdef CONFIG_I2C_STM32_V2_DMA
		if (msg->len) {
			if (msg->flags & I2C_MSG_READ) {
				/* Configure RX DMA */
				data->dma_blk_cfg.source_address = LL_I2C_DMA_GetRegAddr(
					cfg->i2c, LL_I2C_DMA_REG_DATA_RECEIVE);
				data->dma_blk_cfg.dest_address = (uint32_t)msg->buf;
				data->dma_blk_cfg.block_size = msg->len;

				if (configure_dma(&cfg->rx_dma, &data->dma_cfg,
						  &data->dma_blk_cfg) != 0) {
					LOG_ERR("Problem setting up RX DMA");
					return;
				}
				data->current.buf += msg->len;
				data->current.len -= msg->len;
				LL_I2C_EnableDMAReq_RX(i2c);
			} else {
				if (data->current.len) {
					/* Configure TX DMA */
					data->dma_blk_cfg.source_address =
						(uint32_t)data->current.buf;
					data->dma_blk_cfg.dest_address = LL_I2C_DMA_GetRegAddr(
						cfg->i2c, LL_I2C_DMA_REG_DATA_TRANSMIT);
					data->dma_blk_cfg.block_size = msg->len;
					if (configure_dma(&cfg->tx_dma, &data->dma_cfg,
							  &data->dma_blk_cfg) != 0) {
						LOG_ERR("Problem setting up TX DMA");
						return;
					}
					data->current.buf += data->current.len;
					data->current.len -= data->current.len;
					LL_I2C_EnableDMAReq_TX(i2c);
				}
			}
		}
#endif /* CONFIG_I2C_STM32_V2_DMA */

		LL_I2C_Enable(i2c);

		LL_I2C_GenerateStartCondition(i2c);
	}
}

